{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-15-285a6ec2c45a>\u00da\b<lambda>\u0003\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "trainable": true, "output_shape": null, "name": "image_normalization", "batch_input_shape": [null, 32, 32, 1], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "name": "convolution_1", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 5, "nb_filter": 6, "W_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "trainable": true, "nb_col": 5, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "name": "convolution_2", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 5, "nb_filter": 16, "W_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "trainable": true, "nb_col": 5, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "input_dim": 400, "output_dim": 120, "batch_input_shape": [null, 400], "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "name": "hidden1", "input_dtype": "float32", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "input_dim": 120, "output_dim": 84, "batch_input_shape": [null, 120], "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "name": "hidden2", "input_dtype": "float32", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "input_dim": 84, "output_dim": 10, "batch_input_shape": [null, 84], "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "name": "hidden3", "input_dtype": "float32", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "input_dim": 10, "output_dim": 1, "batch_input_shape": [null, 10], "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "name": "steering_angle", "input_dtype": "float32", "activity_regularizer": null, "W_regularizer": null}}]}